tutorials/dualRhoDarcyFoam/2DrandomKSource/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

mu              mu [1 -1 -1 0 0 0 0] 8.9e-04;
rho             rho [1 -3 0 0 0 0 0] 1000;
rho1            rho1 [1 -3 0 0 0 0 0] 1000;
rho2	    	rho2 [1 -3 0 0 0 0 0] 500;
Dm              DT [0 2 -1 0 0 0 0] 1e-10;
tau             tau [-1 1 1 0 0 0 0] 1e-3;
// ************************************************************************* //
