tutorials/dualRhoDarcyFoam/2DrandomKSource/system/fieldMetricsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fieldMetricsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{

    fieldMetrics1
    {
        type           fieldMetrics;
        libs ("libfieldMetricsFunctionObject.so");
        operations ("entropy" "twoPointCorrelation");
        nRadii       100;
        maxDist      1.0;
        fieldName      K;
    }
}
